000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>IDNG</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WEB_АвторепрайсЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_Выгружать</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>WEB_МониторингЦен</name>
    <comment>(NAV&amp;Magento)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Блокирован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерийныеНомера</name>
    <comment>Использовать серийные номера (подарочные сертификаты)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодИзменения</name>
    <comment>NAV: timestamp</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоУКТЗЕД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПериодовДействия</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Маржинальность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Марка</name>
    <type>
      <types>CatalogRef.Марки</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеТовара</name>
    <type>
      <types>EnumRef.НазначенияТовара</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Новинка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НовинкаДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.Периодичность</types>
    </type>
  </attributes>
  <attributes>
    <name>ПечатьЦенниковБезПиктограмм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодакцизныйТовар</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСерийногоНомера</name>
    <type>
      <types>EnumRef.ТипыСерийныхНомеровСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипСрокаДействия</name>
    <type>
      <types>EnumRef.СрокДействияПодарочныхСертификатов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяКатегория</name>
    <type>
      <types>CatalogRef.ТоварныеКатегории</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбычныйЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Эксклюзив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Кешбек</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзОбменаNavision</name>
    <comment>//A++ расширение функционала запрета обмена с Navision</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Хеш</name>
    <comment>Хеш объекта полученного из Navison</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеСписыватьБонусы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЦена</name>
    <comment>Текущая учетная цена (себестоимость) из Navision</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/КлассификаторХарактеристикЦенников/КлассификаторХарактеристикЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КлассификаторХарактеристикЦенников</name>
  <resources>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>Установлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Идентификатор</name>
    <comment>IDN группы. Служебный реквизит</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>512</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Основной</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Значение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/ИсторияИзмененияРеквизитовНоменклатуры/ИсторияИзмененияРеквизитовНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмененияРеквизитовНоменклатуры</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Значение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ЗначенияПолей</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНоменклатуры</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныйСертификат</name>
  </enumValues>
  <enumValues>
    <name>СкидочныйКупон</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/СрокДействияПодарочныхСертификатов/СрокДействияПодарочныхСертификатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СрокДействияПодарочныхСертификатов</name>
  <enumValues>
    <name>БезОграниченияСрока</name>
  </enumValues>
  <enumValues>
    <name>СОграничениемНаДату</name>
  </enumValues>
  <enumValues>
    <name>ПериодПослеПродажи</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Enums/ВидыУзлов/ВидыУзлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыУзлов</name>
  <enumValues>
    <name>ЦентральныйОфис</name>
  </enumValues>
  <enumValues>
    <name>Магазин</name>
  </enumValues>
  <enumValues>
    <name>ИнтернетМагазин</name>
  </enumValues>
  <enumValues>
    <name>ПустойУзел</name>
  </enumValues>
  <enumValues>
    <name>КСУ_Navision</name>
  </enumValues>
  <enumValues>
    <name>ТестовыйУзел</name>
    <comment>В него всё едет, а из него ничего не выгружается.</comment>
  </enumValues>
  <enumValues>
    <name>УзелРРО</name>
    <comment>Энергонезависимая касса</comment>
  </enumValues>
  <enumValues>
    <name>УстройствоМобильное</name>
  </enumValues>
  <enumValues>
    <name>УзелРасчёта</name>
  </enumValues>
</mdclass:Enum>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НаборыУпаковок/НаборыУпаковок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаборыУпаковок</name>
  <predefined>
    <items>
      <name>ИндивидуальныйДляНоменклатуры</name>
      <description>Индивидуальный набор для номенклатуры</description>
    </items>
  </predefined>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.БазовыеЕдиницыИзмерения</types>
    </type>
  </attributes>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыНоменклатуры</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <type>
      <types>EnumRef.ВариантыВеденияДополнительныхДанныхПоНоменклатуре</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьКоличествоСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьНомерСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьХарактеристики</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойств</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаборСвойствХарактеристик</name>
    <type>
      <types>CatalogRef.НаборыДополнительныхРеквизитовИСведений</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаИспользованияСерий</name>
    <type>
      <types>EnumRef.НастройкиИспользованияСерийНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочностьУказанияСрокаГодностиСерии</name>
    <type>
      <types>EnumRef.ТочностиУказанияСрокаГодности</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЦенника</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонЭтикетки</name>
    <type>
      <types>CatalogRef.ХранилищеШаблонов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокГарантии</name>
    <comment>Срок гарантии (мес.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПроекта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IDN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПечататьЦенник</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <attributes>
      <name>Магазин</name>
      <type>
        <types>CatalogRef.Магазины</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <type>
        <types>CatalogRef.ПолитикиУчетаСерий</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/Номенклатура/ObjectModule.bsl
#Область ОбработчикиОсновныхсобытийОбъекта

//Процедура - обработчик события "ОбработкаПроверкиЗаполнения"
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если Не ЭтоГруппа Тогда
		
		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда
			Если ВидНоменклатуры.ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга Тогда
				МассивНепроверяемыхРеквизитов.Добавить("ЕдиницаИзмерения");
			КонецЕсли;
		КонецЕсли;
		
		Если ТипНоменклатуры <> Перечисления.ТипыНоменклатуры.ПодарочныйСертификат Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Номинал");
			МассивНепроверяемыхРеквизитов.Добавить("ТипСрокаДействия");
		КонецЕсли;
		
		Если НЕ ИспользоватьСерийныеНомера Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ТипСерийногоНомера");
		КонецЕсли;
		
		Если ТипСрокаДействия <> Перечисления.СрокДействияПодарочныхСертификатов.СОграничениемНаДату Тогда
			МассивНепроверяемыхРеквизитов.Добавить("ДатаОкончанияДействия");
		КонецЕсли;
		
		Если ТипСрокаДействия <> Перечисления.СрокДействияПодарочныхСертификатов.ПериодПослеПродажи Тогда
			МассивНепроверяемыхРеквизитов.Добавить("Периодичность");
			МассивНепроверяемыхРеквизитов.Добавить("КоличествоПериодовДействия");
		КонецЕсли;
		
		ИспользоватьАссортимент = АссортиментСервер.ПолучитьФункциональнуюОпциюИспользованияАссортимента();
		Если ИспользоватьАссортимент Тогда
			ВладелецКатегории = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТоварнаяКатегория, "Владелец");
			Если ЗначениеЗаполнено(ТоварнаяКатегория) И ВладелецКатегории <> ВидНоменклатуры Тогда
				ТекстСообщения = НСтр("ru = 'Владелец товарной категории не соответствует виду номенклатуры'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ТекстСообщения,
					Ссылка,
					"ТоварнаяКатегория",
					"Объект");
				Отказ=Истина;
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	
КонецПроцедуры

//Процедура - обработчик события "ПередЗаписью"
//
Процедура ПередЗаписью(Отказ)

	РеквизитыСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Родитель, Эксклюзив, Новинка, НовинкаДо, IDNG");
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("Родитель", РеквизитыСсылки.Родитель);
	ДополнительныеСвойства.Вставить("IDNG"    , РеквизитыСсылки.IDNG);

	УстановитьДатуИзменения(РеквизитыСсылки);
	
//	LNK 06.09.2016 09:19:35
	Если ОбменДанными.Загрузка ИЛИ НЕ ПроверитьУникальностьIDN(Отказ) Тогда
		
		Возврат;
		
	КонецЕсли;

//	LNK 17.01.2017 10:25:38
	Если НЕ ЭтоГруппа
	И НЕ (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.Услуга ИЛИ ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат) Тогда

		НуженТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры");

		Если НЕ ТипНоменклатуры = НуженТипНоменклатуры Тогда

			ТипНоменклатуры = НуженТипНоменклатуры;

		КонецЕсли;

	ИначеЕсли ЭтоГруппа Тогда

	//	LNK 18.01.2021 06:43:27 - только при загрузке из NAV!
	//	IDNG = Справочники.Номенклатура.СформироватьIDNGroup(IDN, Родитель, Ссылка);

	КонецЕсли;

//	LNK 17.01.2017 10:25:33
	Если ПроверитьДопустимостьЗаписиОбъекта(Отказ) Тогда

		Если НЕ ЭтоГруппа Тогда
			
			Если НЕ (ТипНоменклатуры = Перечисления.ТипыНоменклатуры.ПодарочныйСертификат				// +HVOYA. 23.08.2016 22:59:42, Львова Е.А.
				ИЛИ  ТипНоменклатуры = Перечисления.ТипыНоменклатуры.СкидочныйКупон) Тогда
			
				ИспользоватьСерийныеНомера = Ложь;

			КонецЕсли;
					
			Если ЗначениеЗаполнено(НаборУпаковок)
				И НаборУпаковок <> Справочники.НаборыУпаковок.ИндивидуальныйДляНоменклатуры
				И ЕдиницаИзмерения <> НаборУпаковок.ЕдиницаИзмерения Тогда
				
				ЕдиницаИзмерения = НаборУпаковок.ЕдиницаИзмерения; 
				
			КонецЕсли;
				
		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

//	LNK 31.01.2017 11:36:35
Процедура ПриЗаписи(Отказ)
	
	Если ЭтоГруппа И ДополнительныеСвойства.Свойство("ОбменДаннымиNavision") И ДополнительныеСвойства.ОбменДаннымиNavision = Истина Тогда

	//	LNK 01.07.2020 09:36:55
		РегистрыСведений.КлассификаторХарактеристикЦенников.КорректировкаИдентификаторов(ДополнительныеСвойства.IDNG, IDNG, Ссылка);

	КонецЕсли;
	
	//А++ 20240918 по задаче Кешбэка
	Если Не ЭтоГруппа Тогда
		РегистрыСведений.ИсторияИзмененияРеквизитовНоменклатуры.ЗаписатьИсториюРеквизита(Ссылка,"Кешбек",Кешбек,ОбменДанными.Загрузка);
	КонецЕсли;
	//А++ 20240918 по задаче Кешбэка

	Если ОбменДанными.Загрузка Тогда

		Возврат;

	КонецЕсли;

	Если НЕ ДополнительныеСвойства.ЭтоНовый И НЕ ДополнительныеСвойства.Родитель = Родитель Тогда

		ЖурналСобытий.Регистрация("Номенклатура.Родитель", УровеньЖурналаРегистрации.Предупреждение, Метаданные(), Ссылка,
		, "Родитель изменён с «" + ДополнительныеСвойства.Родитель + "» на «" + Родитель + "»."
		, СокрЛП(Ссылка), Истина);

	КонецЕсли;
	
	
КонецПроцедуры

//Процедура - обработчик события "ОбработкаЗаполнения"
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если НЕ ЭтоГруппа Тогда
		
		ВидНоменклатуры = Справочники.ВидыНоменклатуры.ПолучитьВидНоменклатурыПоУмолчанию();
		
		Если ЗначениеЗаполнено(ВидНоменклатуры) Тогда

			ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ВидНоменклатуры, "ТипНоменклатуры", Перечисления.ТипыНоменклатуры.Товар, Ложь);

		КонецЕсли;
		
		ЕдиницаИзмерения = Справочники.БазовыеЕдиницыИзмерения.ПолучитьЕдиницуИзмеренияПоУмолчанию();

		IDNG = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "IDNG", "", Ложь);
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ЭтоГруппа Тогда

		ФайлКартинки = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
		НаименованиеПолное = "";

		WEB_АвторепрайсЦен	= Ложь;
		WEB_Выгружать		= Ложь;
		WEB_МониторингЦен	= Ложь;

	КонецЕсли;

	IDN  = "";
	IDNG = "";
	КодИзменения = "";
	
КонецПроцедуры
	
#КонецОбласти

#Область ПоддержкаФункционалаМодуля

//	LNK 06.09.2016 09:20:44
Функция ПроверитьУникальностьIDN(Отказ)

	Если ЭтоНовый() И НЕ ПустаяСтрока(IDN) Тогда

		УстановитьПривилегированныйРежим(Истина);

		ЭлементСправочника = Справочники.Номенклатура.НайтиПоРеквизиту("IDN", IDN);

		Если ЗначениеЗаполнено(ЭлементСправочника) Тогда

			Отказ = Истина;
			ТекстСообщения = "IDN = [" + IDN + "] - блокирована попытка создания дубля! Отказано.";
			ЗаписьЖурналаРегистрации("IDN.Уникальность", УровеньЖурналаРегистрации.Ошибка, Метаданные(), ЭлементСправочника, ТекстСообщения, РежимТранзакцииЗаписиЖурналаРегистрации.Транзакционная);
			Сообщить(ТекстСообщения);

		КонецЕсли;

		УстановитьПривилегированныйРежим(Ложь);

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции // ПроверитьУникальностьIDN()

//	LNK 17.01.2017 09:53:09
Функция ПроверитьДопустимостьЗаписиОбъекта(Отказ)

	Если НЕ Справочники.Номенклатура.ТипыИсключенийНоменклатуры().Получить(ТипНоменклатуры) = Истина Тогда

		ЕстьРазрешениеИзменения = (ТехническаяПоддержкаВызовСервера.ИсключительныйРежим() И ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() ИЛИ ПараметрыСеанса.ВыполняютсяСлужебныеДействия)
						ИЛИ ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().ВидУзла = Перечисления.ВидыУзлов.ТестовыйУзел	//	LNK 18.02.2022 11:34:33
						ИЛИ ТехническаяПоддержкаВызовСервера.ОтладочныйРежимРаботы();	//	LNK 21.02.2022 14:17:51

		ЖурналСобытий.Регистрация("Номенклатура", УровеньЖурналаРегистрации.Предупреждение
		, Метаданные()
		, Ссылка
		,
		, "Фиксация изменений справочника «Номенклатура»" + ?(ЕстьРазрешениеИзменения, ". Получено разрешение на изменение.", "")
		, СокрЛП(Ссылка)
		, Истина);

		Если НЕ ЕстьРазрешениеИзменения Тогда

			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Отказано. Изменения справочника «Номенклатура» запрещены!",,,, Отказ);

		КонецЕсли;

	КонецЕсли;

	Возврат НЕ Отказ;

КонецФункции

Процедура УстановитьДатуИзменения(РеквизитыСсылки)

	Если НЕ ЭтоНовый() И НЕ ЭтоГруппа И ОбменДаннымиПовтИсп.ЭтоГлавныйУзел() Тогда

		Если РеквизитыСсылки.Эксклюзив <> Эксклюзив ИЛИ РеквизитыСсылки.Новинка <> Новинка тогда

			ДатаИзменения = ТекущаяДата();

		КонецЕсли;

		Если Новинка тогда

			Если РеквизитыСсылки.НовинкаДо <> НовинкаДо тогда

				Если РеквизитыСсылки.НовинкаДо >= ТекущаяДата() тогда

					Если НовинкаДо < ТекущаяДата() Тогда

						ДатаИзменения = ТекущаяДата();	

					КонецЕсли;				

				Иначе	

					Если НовинкаДо > ТекущаяДата() Тогда

						ДатаИзменения = ТекущаяДата();	

					КонецЕсли; 				

				КонецЕсли;			

			КонецЕсли;

		КонецЕсли;  					

	КонецЕсли;

КонецПроцедуры
	
#КонецОбласти
